project/app/controllers/v1/carpool_controller.rb

SELECT `routes`.* FROM `routes`
---
    def index # GET
      routes = Route.all
      result = []
      routes.each do |t|

SELECT  `routes`.* FROM `routes` WHERE `routes`.`id` = 1 LIMIT 1
---
    def show # GET
      routes = Route.find(params[:id])

INSERT INTO `routes` (`id`, `destination`, `departure`, `kilometers`) VALUES (1, 'Freistadt', 'Linz', 60.0)
---
    def create # POST
      routes = JSON.parse(request.body.read)
      Route.create!(routes)