project/app/controllers/v1/user_controller.rb

SELECT `users`.* FROM `users`
---
    def index # GET
      users = User.all
      result = []
      users.each do |t|

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def show # GET
      users = User.find(params[:id])

INSERT INTO `users` (`username`, `firstName`, `lastName`, `password`) VALUES ('manuelkomm', 'Manuel', 'Kommenda', '2345')
---
    def create
      users = JSON.parse(request.body.read)
      User.create!(users)